[Demo_Maya_ep2_2 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-1640,Y=590,Z=537),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',Vec=(X=-1640,Y=780,Z=402),VecSub=(X=-90,Y=0,Z=0),CId=72)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-1800,Y=685,Z=402),VecSub=(X=-30,Y=0,Z=0),CId=71)
DemoScripts[5]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[6]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0001_lp_open_angry",motionName[1]="kr_CM_0001_fx_close_down",motionName[2]="kr_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0300_lp_Furry",Rate=0,Number=3,Bit=5)
DemoScripts[8]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[9]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus.GG2_AMB_Campus_LP_Cue')
DemoScripts[10]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[11]=(Actor=FADE,Command=WAIT)
DemoScripts[12]=(Actor=WINDOW,Command=SET)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[14]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep2_2.GG2_V_Maya_ep2_2_002_Cue',Name="クロナ")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[16]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[17]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[0]="kr_CE_0101_fx_close_smile",motionName[1]="kr_CM_0003_fx_close_smile_L",motionName[2]="kr_DM_0102_fx_Stand2Proud",Rate=0,Number=3,Bit=0)
DemoScripts[18]=(Actor=CHARACTER,Command=ACTION,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',motionName[2]="kr_DM_0200_lp_Proud",Number=8)
DemoScripts[19]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep2_2.GG2_V_Maya_ep2_2_003_Cue',Name="クロナ")
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[21]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[22]=(Actor=WINDOW,Command=EXIT)
DemoScripts[23]=(Actor=FADE,Command=SET,SecTime=0.3,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[24]=(Actor=FADE,Command=WAIT)
DemoScripts[25]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_DM_Away_Normal_Cue')
DemoScripts[26]=(Actor=CHARACTER,Command=EXIT,Name="クロナ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.72_KURONA',CId=72)
DemoScripts[27]=(Actor=FADE,Command=EXIT,SecTime=0.3,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[28]=(Actor=FADE,Command=WAIT)
DemoScripts[29]=(Actor=WINDOW,Command=SET)
DemoScripts[30]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[32]=(Actor=WINDOW,Command=EXIT)
DemoScripts[33]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=150,Y=-5,Z=0),SecTime=0.3)
DemoScripts[34]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[35]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=150,Y=-5,Z=0),SecTime=)
DemoScripts[36]=(Actor=WINDOW,Command=SET)
DemoScripts[37]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep2_2.GG2_V_Maya_ep2_2_006_Cue',Name="エコロ")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[39]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[41]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0301_fx_Furry2Stand",Rate=0,Number=2,Bit=0)
DemoScripts[42]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[43]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep2_2.GG2_V_Maya_ep2_2_008_Cue',Name="エコロ")
DemoScripts[44]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[45]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[46]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[47]=(Actor=WINDOW,Command=EXIT)
DemoScripts[48]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[49]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[50]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[51]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[52]=(Actor=SYSTEM,Command=END)

[Select_Maya_ep2_2 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[1]=(Label="SELECT01",SelectNumber=4,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[2]=(Label="SELECT02",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))

[Text_Maya_ep2_2 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="總算是成功昇天了......")

Texts[1]=(Label="TEXT02",Name="???",Text="呣呣!/n明明是人類,卻意外地有本事DEATH!")

Texts[2]=(Label="TEXT03",Name="???",Text="不過不過! 庫蘿娜的惡作劇/n還只是剛開始DEATH!/n好~前往下個現場DEATH~!")

Texts[3]=(Label="TEXT04",Name="峯大",Text="啊......!")

Texts[4]=(Label="TEXT05",Name="峯大",Text="跑掉了......")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="峯大大人......既然那個惡魔在這裡,/n接下來恐怕也會有被黑暗能量操控的/n女孩子出現.而且是源源不絕!")

Texts[6]=(Label="TEXT07",Name="峯大",Text="嗯,要是遇見了,/n得要讓她們恢復原狀啊......")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="被黑暗能量操控的女孩子/n會比平常還要更加強大./n請務必小心唷.")

Texts[8]=(Label="TEXT09",Name="峯大",Text="我的戀愛之路......前途多舛啊......")

Texts[9]=(Label="",Name="",Text="")


